perf/results/cassandra/write_200rps.txt
Running 30s test @ http://localhost:9411
  4 threads and 50 connections
  Thread calibration: mean lat.: 2.028ms, rate sampling interval: 10ms
  Thread calibration: mean lat.: 2.146ms, rate sampling interval: 10ms
  Thread calibration: mean lat.: 2.049ms, rate sampling interval: 10ms
  Thread calibration: mean lat.: 2.221ms, rate sampling interval: 10ms
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency     1.67ms    0.96ms  16.80ms   85.47%
    Req/Sec    54.94     93.20   400.00     77.66%
  Latency Distribution (HdrHistogram - Recorded Latency)
 50.000%    1.49ms
 75.000%    1.98ms
 90.000%    2.58ms
 99.000%    5.12ms
 99.900%    9.39ms
 99.990%   16.82ms
 99.999%   16.82ms
100.000%   16.82ms

  Detailed Percentile spectrum:
       Value   Percentile   TotalCount 1/(1-Percentile)

       0.311     0.000000            1         1.00
       0.825     0.100000          401         1.11
       1.020     0.200000          797         1.25
       1.183     0.300000         1197         1.43
       1.331     0.400000         1595         1.67
       1.486     0.500000         1992         2.00
       1.574     0.550000         2196         2.22
       1.664     0.600000         2391         2.50
       1.756     0.650000         2591         2.86
       1.863     0.700000         2789         3.33
       1.978     0.750000         2988         4.00
       2.053     0.775000         3090         4.44
       2.127     0.800000         3190         5.00
       2.197     0.825000         3288         5.71
       2.281     0.850000         3390         6.67
       2.419     0.875000         3488         8.00
       2.495     0.887500         3537         8.89
       2.575     0.900000         3587        10.00
       2.669     0.912500         3638        11.43
       2.793     0.925000         3686        13.33
       2.961     0.937500         3735        16.00
       3.043     0.943750         3760        17.78
       3.121     0.950000         3786        20.00
       3.271     0.956250         3810        22.86
       3.377     0.962500         3835        26.67
       3.587     0.968750         3860        32.00
       3.749     0.971875         3872        35.56
       3.883     0.975000         3885        40.00
       4.055     0.978125         3897        45.71
       4.243     0.981250         3911        53.33
       4.579     0.984375         3922        64.00
       4.683     0.985938         3928        71.11
       4.887     0.987500         3935        80.00
       4.995     0.989062         3941        91.43
       5.243     0.990625         3947       106.67
       5.859     0.992188         3953       128.00
       6.119     0.992969         3956       142.22
       6.215     0.993750         3960       160.00
       6.471     0.994531         3963       182.86
       6.627     0.995313         3966       213.33
       7.351     0.996094         3969       256.00
       7.887     0.996484         3970       284.44
       8.003     0.996875         3972       320.00
       8.367     0.997266         3974       365.71
       8.391     0.997656         3975       426.67
       8.935     0.998047         3977       512.00
       8.935     0.998242         3977       568.89
       8.975     0.998437         3978       640.00
       9.015     0.998633         3979       731.43
       9.391     0.998828         3980       853.33
       9.439     0.999023         3981      1024.00
       9.439     0.999121         3981      1137.78
       9.439     0.999219         3981      1280.00
      11.167     0.999316         3982      1462.86
      11.167     0.999414         3982      1706.67
      15.263     0.999512         3983      2048.00
      15.263     0.999561         3983      2275.56
      15.263     0.999609         3983      2560.00
      15.263     0.999658         3983      2925.71
      15.263     0.999707         3983      3413.33
      16.815     0.999756         3984      4096.00
      16.815     1.000000         3984          inf
#[Mean    =        1.666, StdDeviation   =        0.964]
#[Max     =       16.800, Total count    =         3984]
#[Buckets =           27, SubBuckets     =         2048]
----------------------------------------------------------
  6004 requests in 30.00s, 615.64KB read
Requests/sec:    200.11
Transfer/sec:     20.52KB