perf/results/cassandra/write_200rps.txt
Running 30s test @ http://localhost:9411
  4 threads and 50 connections
  Thread calibration: mean lat.: 1.935ms, rate sampling interval: 10ms
  Thread calibration: mean lat.: 1.949ms, rate sampling interval: 10ms
  Thread calibration: mean lat.: 1.929ms, rate sampling interval: 10ms
  Thread calibration: mean lat.: 2.524ms, rate sampling interval: 10ms
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency     2.16ms    2.27ms  31.06ms   94.88%
    Req/Sec    54.46    146.17     1.33k    91.71%
  Latency Distribution (HdrHistogram - Recorded Latency)
 50.000%    1.66ms
 75.000%    2.32ms
 90.000%    3.25ms
 99.000%   14.29ms
 99.900%   27.90ms
 99.990%   31.07ms
 99.999%   31.07ms
100.000%   31.07ms

  Detailed Percentile spectrum:
       Value   Percentile   TotalCount 1/(1-Percentile)

       0.269     0.000000            1         1.00
       0.913     0.100000          399         1.11
       1.134     0.200000          798         1.25
       1.315     0.300000         1196         1.43
       1.490     0.400000         1597         1.67
       1.661     0.500000         1992         2.00
       1.762     0.550000         2192         2.22
       1.858     0.600000         2391         2.50
       1.987     0.650000         2590         2.86
       2.121     0.700000         2790         3.33
       2.317     0.750000         2988         4.00
       2.409     0.775000         3089         4.44
       2.519     0.800000         3188         5.00
       2.627     0.825000         3287         5.71
       2.805     0.850000         3387         6.67
       3.005     0.875000         3486         8.00
       3.139     0.887500         3537         8.89
       3.251     0.900000         3586        10.00
       3.433     0.912500         3638        11.43
       3.583     0.925000         3686        13.33
       3.981     0.937500         3735        16.00
       4.259     0.943750         3760        17.78
       4.471     0.950000         3785        20.00
       4.863     0.956250         3810        22.86
       5.175     0.962500         3835        26.67
       6.179     0.968750         3860        32.00
       7.143     0.971875         3872        35.56
       7.783     0.975000         3885        40.00
       8.879     0.978125         3897        45.71
      10.703     0.981250         3910        53.33
      11.903     0.984375         3922        64.00
      12.527     0.985938         3928        71.11
      13.951     0.987500         3935        80.00
      14.223     0.989062         3941        91.43
      14.487     0.990625         3947       106.67
      14.735     0.992188         3953       128.00
      14.823     0.992969         3956       142.22
      15.015     0.993750         3960       160.00
      15.279     0.994531         3963       182.86
      15.367     0.995313         3966       213.33
      15.631     0.996094         3969       256.00
      16.055     0.996484         3970       284.44
      16.575     0.996875         3972       320.00
      19.487     0.997266         3974       365.71
      20.591     0.997656         3975       426.67
      23.199     0.998047         3977       512.00
      23.199     0.998242         3977       568.89
      24.271     0.998437         3978       640.00
      27.759     0.998633         3979       731.43
      27.903     0.998828         3980       853.33
      27.999     0.999023         3981      1024.00
      27.999     0.999121         3981      1137.78
      27.999     0.999219         3981      1280.00
      28.143     0.999316         3982      1462.86
      28.143     0.999414         3982      1706.67
      30.847     0.999512         3983      2048.00
      30.847     0.999561         3983      2275.56
      30.847     0.999609         3983      2560.00
      30.847     0.999658         3983      2925.71
      30.847     0.999707         3983      3413.33
      31.071     0.999756         3984      4096.00
      31.071     1.000000         3984          inf
#[Mean    =        2.155, StdDeviation   =        2.265]
#[Max     =       31.056, Total count    =         3984]
#[Buckets =           27, SubBuckets     =         2048]
----------------------------------------------------------
  5959 requests in 30.05s, 611.03KB read
Requests/sec:    198.33
Transfer/sec:     20.34KB